In [4]:
a=1.1
print(a)

1.1

In [5]:
list1=range(1, 10)
print(list(list1))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
lst=[5,1,5,12,4,423,423,423,423,4,23]
print("Array elements:", lst)
lst[0:6:1]


list(range(1,5,2))

Array elements: [5, 1, 5, 12, 4, 423, 423, 423, 423, 4, 23]

[1, 3]

In [7]:
# 2*1 = 2

for i in range(0, 11):
    print(f"2 * {i} = {2*i}")
    if i==11:
        print("End of table")

print("Continuing...")

2 * 0 = 0
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
2 * 10 = 20
Continuing...

In [8]:
# *
# **
# ***

for i in range(1, 4):
    print('*' * i)
# ***
# **
# *
for i in range(10, 0,-2):
    print('*' * i)

*
**
***
**********
********
******
****
**

In [9]:
# *****
#  ***
#   *
for i in range(5, 0, -2):
    print(' ' * ((5 - i)//2) + '*' * i)

*****
 ***
  *

*Star Pattern printing cross odd length numbers*

In [10]:
nums = "1234567"

for i in range(len(nums)):
    for j in range(len(nums)):
        if i == j or i + j == len(nums)-1:
            print(nums[i], end = " ")
        else:
            print(" ", end = " ")
    print()

1           1
  2       2
    3   3
      4
    5   5
  6       6
7           7

*Star Pattern printing cross odd length numbers*

In [11]:
nums = "7654321"

for i in range(len(nums)):
    for j in range(len(nums)):
        if i == j or i + j == len(nums)-1:
            print(nums[j], end = " ")
        else:
            print(" ", end = " ")
    print()

7           1
  6       2
    5   3
      4
    5   3
  6       2
7           1

*Pattern printing numbers*

In [12]:
nums = 4

for i in range(nums):
    k = 111
    for j in range(i+1):
        print(k, end =" ")
        k += 111
    print()

111
111 222
111 222 333
111 222 333 444

*Pattern printing numbers*

In [13]:
nums = 5

for i in range(nums):
    k = 111
    for j in range(nums-i-1):
        print("   ", end = " ")
    for j in range(i+1):
        print(k, end =" ")
        k += 111
    print()

                111
            111 222
        111 222 333
    111 222 333 444
111 222 333 444 555

*Pattern printing numbers*

In [14]:
nums = 5

for i in range(nums):
    k = 111
    for j in range(nums-i-1):
        print("   ", end = " ")
    k *= (i+1)
    for j in range(i+1):
        print(k, end =" ")
        k -= 111
    print()

                111
            222 111
        333 222 111
    444 333 222 111
555 444 333 222 111

Diamond Star Pattern

In [15]:
row = 5
for i in range(row):
    for j in range(row-i):
        print(format("*", "<2"), end = "")
    for j in range(row - (row-i)):
        print(format("","<1"), end = "")
    # print()
    for j in range(row - (row-i)):
        print(format(" ", ">3"), end = "")
    for j in range(row-i):
        print(format("*", ">2"), end = "")
    print()

for i in range(row):
    for j in range(i+1):
        print(format("*", "<2"), end = "")
    for j in range(row-1-i):
        print(format("", "<1"), end = "")
    for j in range(row-1-i):
        print(format(" ", ">3"), end = "")
    for j in range(i+1):
        print(format("*", ">2"), end = "")

    print()

* * * * *  * * * * *
* * * *      * * * *
* * *          * * *
* *              * *
*                  *
*                  *
* *              * *
* * *          * * *
* * * *      * * * *
* * * * *  * * * * *

LCM

In [16]:
class Solution:
    # @staticmethod
    def Compute_LCM(self,n1, n2):
        if n1 > n2:
            higher = n1
        else:
            higher = n2

        value = higher

        while True:
            if higher % n1 == 0 and higher % n2 == 0:
                return(f"LCM of {n1} and {n2} is {higher}")
                break
            else:
                higher += value
sol = Solution()
print(sol.Compute_LCM(108,901))

LCM of 108 and 901 is 97308

Diamond Numbers Pattern

In [17]:
# Q: Number Diamond Pattern

num = 9
# For space we can do this as well but this will not work for any number of row so have to neglect this approach
# space = (num*2)+1-(row*3) when num = 4

for row in range(num):
    for col in range(num-1-row):
        print(" ", end = "  ")
    for col in range(row+1,0,-1):
        print(col, end = " ")
    if row > 0:
        for col in range(row-1):
            print(" ", end = " ")
        for col in range(row+1):
            print(col+1, end = " ")               
    print()

for row in range(num-1):
    for col in range(row+1):
        print(" ", end = "  ")
    for col in range(num-1-row,0,-1):
        print(col, end = " ")
    if row < (num-2):
        for col in range(num-row-3):
            print(" ", end = " ")
        for col in range(num-row-1):
            print(col+1, end = " ")               
    print()

                        1
                     2 1 1 2
                  3 2 1   1 2 3
               4 3 2 1     1 2 3 4
            5 4 3 2 1       1 2 3 4 5
         6 5 4 3 2 1         1 2 3 4 5 6
      7 6 5 4 3 2 1           1 2 3 4 5 6 7
   8 7 6 5 4 3 2 1             1 2 3 4 5 6 7 8
9 8 7 6 5 4 3 2 1               1 2 3 4 5 6 7 8 9
   8 7 6 5 4 3 2 1             1 2 3 4 5 6 7 8
      7 6 5 4 3 2 1           1 2 3 4 5 6 7
         6 5 4 3 2 1         1 2 3 4 5 6
            5 4 3 2 1       1 2 3 4 5
               4 3 2 1     1 2 3 4
                  3 2 1   1 2 3
                     2 1 1 2
                        1

In [18]:
2**7 *4

512

In [3]:
!pip install openpyxl --quiet

In [7]:
import pandas as pd
import seaborn as sns
tit = sns.load_dataset("titanic")
tit.to_excel("./DataSets/tit.xlsx")
tit.to_csv("./DataSets/tit.csv")

In [8]:
df = pd.read_csv("./DataSets/tit.csv")
# df_2 = pd.read_excel("./DataSets/tit.xlsx")
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    str
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    str
 9   class        891 non-null    str
 10  who          891 non-null    str
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    str
 13  embark_town  889 non-null    str
 14  alive        891 non-null    str
 15  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(5), str(7)
memory usage: 99.3 KB

In [9]:
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
df.tail()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
df.count()

Unnamed: 0     891
survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64